#include <bits/stdc++.h>
using namespace std;


int main() {

  long long N;
  cin >> N;

  //                     0 <= N ... 0
  //                 1,000 <= N ... N -             999 回　1つコンマを打つ
  //             1,000,000 <= N ... N -          999999 回　もう１つコンマを打つ
  //         1,000,000,000 <= N ... N -       999999999 回　もう１つコンマを打つ
  //     1,000,000,000,000 <= N ... N -    999999999999 回　もう１つコンマを打つ
  // 1,000,000,000,000,000 <= N ... N - 999999999999999 回　もう１つコンマを打つ
  
  long long ans = 0;
  
  if (1000 <= N) {
    ans += N - 999;
  }

  if (1000000 <= N) {
    ans += N - 999999;
  }

  if (1000000000 <= N) {
    ans += N - 999999999;
  }

  if (1000000000000 <= N) {
    ans += N - 999999999999;
  }

  if (1000000000000000 <= N) {
    ans += N - 999999999999999;
  }

  cout << ans << endl;

  return 0;

}